Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-MC_DFP/1.0.32/edc/PIC32CM1216MC00032.PIC
      <edc:SFRDef edc:_addr="0x42003C08" edc:access="--nn--nn" edc:cname="INTENCLR" edc:impl="0x33" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="OVF" edc:desc="OVF Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERR" edc:desc="ERR Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MC0" edc:desc="MC Interrupt Disable 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MC1" edc:desc="MC Interrupt Disable 1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C09" edc:access="--nn--nn" edc:cname="INTENSET" edc:impl="0x33" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="OVF" edc:desc="OVF Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERR" edc:desc="ERR Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MC0" edc:desc="MC Interrupt Enable 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MC1" edc:desc="MC Interrupt Enable 1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C0A" edc:access="--nn--nn" edc:cname="INTFLAG" edc:impl="0x33" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="OVF" edc:desc="OVF Interrupt Flag" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ERR" edc:desc="ERR Interrupt Flag" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="MC0" edc:desc="MC Interrupt Flag 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MC1" edc:desc="MC Interrupt Flag 1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C0B" edc:access="--nnn-nn" edc:cname="STATUS" edc:impl="0x3B" edc:mclr="00000001" edc:nzwidth="0x8" edc:por="00000001" ltx:memberofperipheral="TC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="STOP" edc:desc="Stop Status Flag" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SLAVE" edc:desc="Slave Status Flag" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PERBUFV" edc:desc="Synchronization Busy Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCBUFV0" edc:desc="Compare channel buffer 0 valid" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCBUFV1" edc:desc="Compare channel buffer 1 valid" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C0C" edc:access="------nn" edc:cname="WAVE" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="WAVEGEN" edc:desc="Waveform Generation Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NFRQ" edc:desc="Normal frequency" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="MFRQ" edc:desc="Match frequency" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="NPWM" edc:desc="Normal PWM" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="MPWM" edc:desc="Match PWM" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C0D" edc:access="------nn" edc:cname="DRVCTRL" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="INVEN0" edc:desc="Output Waveform Invert Enable 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INVEN1" edc:desc="Output Waveform Invert Enable 1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42003C0E" edc:offset="0x1"/>
      <edc:SFRDef edc:_addr="0x42003C0F" edc:access="-------n" edc:cname="DBGCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="DBGRUN" edc:desc="Run During Debug" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42003C10" edc:access="------------------------rrrrrrrr" edc:cname="SYNCBUSY" edc:impl="0xFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TC3">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC3">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="swrst" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTRLB" edc:desc="CTRLB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STATUS" edc:desc="STATUS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COUNT" edc:desc="Counter" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PER" edc:desc="Period" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CC0" edc:desc="Compare Channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CC1" edc:desc="Compare Channel 1" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42003C14" edc:offset="0x3EC"/>
      <edc:SFRDef edc:_addr="0x42004000" edc:access="----------nn--nn----nnnnnnnnnnnn" edc:cname="CTRLA" edc:impl="0x330FFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="TC4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TC4">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODE" edc:desc="Timer Counter Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="COUNT16" edc:desc="Counter in 16-bit mode" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="COUNT8" edc:desc="Counter in 8-bit mode" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="COUNT32" edc:desc="Counter in 32-bit mode" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="PRESCSYNC" edc:desc="Prescaler and Counter Synchronization" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="GCLK" edc:desc="Reload or reset the counter on next generic clock" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="PRESC" edc:desc="Reload or reset the counter on next prescaler clock" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="RESYNC" edc:desc="Reload or reset the counter on next generic clock and reset the prescaler counter" edc:when="(field &amp; 0x3) == 2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run during Standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONDEMAND" edc:desc="Clock On Demand" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PRESCALER" edc:desc="Prescaler" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="Prescaler: GCLK_TC" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Prescaler: GCLK_TC/2" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="Prescaler: GCLK_TC/4" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="Prescaler: GCLK_TC/8" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="Prescaler: GCLK_TC/16" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="Prescaler: GCLK_TC/64" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="Prescaler: GCLK_TC/256" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="DIV1024" edc:desc="Prescaler: GCLK_TC/1024" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ALOCK" edc:desc="Auto Lock" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="CAPTEN0" edc:desc="Capture Channel 0 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAPTEN1" edc:desc="Capture Channel 1 Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="COPEN0" edc:desc="Capture On Pin 0 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="COPEN1" edc:desc="Capture On Pin 1 Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
